ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
}

/*==============================================================================
 * VISUALIZACIÓN DE LOS VALORES CNY70
 *============================================================================*/

static void mostrar_valor_cny70(uint8_t numero_sensor, uint16_t valor)
{
    /*
     * Limpia la pantalla y muestra el número del sensor.
     */
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1, 0);
    LCD_I2C_WriteString("Sensor ");
    LCD_I2C_WriteInt(numero_sensor);

    /*
     * Muestra el valor obtenido mediante el ADC.
     */
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Valor: ");
    LCD_I2C_WriteInt(valor);

    /*
     * Mantiene el valor visible durante un segundo.
     */
    __delay_ms(1000);
}

/*==============================================================================
 * LECTURA DE LOS SENSORES CNY70
 *============================================================================*/

void lectura_cny70(void)
{
    
    /*
     * Lee el primer sensor y muestra su valor.
     */
    valor_S1 = CNY70_Read(&sensor1);
    mostrar_valor_cny70(1, valor_S1);

    /*
     * Lee el segundo sensor y muestra su valor.
     */
    valor_S2 = CNY70_Read(&sensor2);
    mostrar_valor_cny70(2, valor_S2);

    /*
     * Lee el tercer sensor y muestra su valor.
     */
    valor_S3 = CNY70_Read(&sensor3);
    mostrar_valor_cny70(3, valor_S3);

    /*
     * Lee el cuarto sensor y muestra su valor.
     */
    valor_S4 = CNY70_Read(&sensor4);
    mostrar_valor_cny70(4, valor_S4);
}

/*==============================================================================
 * VERIFICACIÓN DE LAS CONDICIONES INICIALES
 *============================================================================*/

void verificar_condiciones_iniciales(void)
{
    /*
     * Verifica que la dirección del LCD se haya configurado
     * correctamente.
     */
    if (estado != I2C_OK)
    {
        sistem_error("I2C sin conexion");
    }

    /*
     * Lee la fecha y la hora almacenadas en el DS1307.
     */
    estado = DS1307_ReadDateTime(&fechaHora);

    /*
     * Comprueba si el RTC respondió mediante el bus I2C.
     */
    if (estado != I2C_OK)
    {
        sistem_error("RTC sin conexion");
        Buzzer_WarningSound(&buzzer1);
    }

    /*
     * clock_running igual a cero indica que el bit CH
     * está en uno y el oscilador se encuentra detenido.
     */
    if (fechaHora.clock_running == 0)
    {
        sistem_error("RTC detenido");
        Buzzer_WarningSound(&buzzer1);
    }

    /*
     * data_valid igual a cero indica que la fecha o la hora
     * almacenada contiene valores fuera del rango permitido.
     */
    if (fechaHora.data_valid == 0)
    {
        sistem_error("Fecha invalida");
        Buzzer_WarningSound(&buzzer1);
    }

    /*
     * Falta implementar la comprobación de los datos
     * almacenados en la memoria EEPROM o DFM.
     */
    /* TODO: verificar la memoria EEPROM/DFM. */

    /*
     * Indica que todas las comprobaciones iniciales
     * finalizaron correctamente.
     */
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1, 0);
    LCD_I2C_WriteString("Sistema correcto");

    /*
     * Enciende la tira LED en color verde.
     */
    WS2812B_RGB(&tira1, 0, 200, 0);

    __delay_ms(1000);
    //SubProceso_ResetSistema();
    SubProceso_MenuLCD();
    __delay_ms(2000);        
    while(1){
        lectura_cny70();
        __delay_ms(1000);
    }
    
}

/*==============================================================================
 * SISTEMA DE ERROR
 *============================================================================*/

void sistem_error(const char *mensaje)
{
    /*
     * Limpia la pantalla y muestra el mensaje de error.
     */
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1, 0);
    LCD_I2C_WriteString("Error en sistema");

    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString(mensaje);

    /*
     * Enciende la tira LED en color rojo.
     */
    WS2812B_RGB(&tira1, 200, 0, 0);

    /*
     * Detiene el programa para evitar que el sistema
     * continúe funcionando después del error.
     */
    while (1)
    {
        __delay_ms(1000);
    }
}
/******************************************************************************
 * Función: MostrarAnimacionCarga
 * ---------------------------------------------------------------------------
 * Muestra una animación de progreso utilizando 4 bloques sólidos.
 *
 * Parámetros:
 *      fila    -> Fila donde inicia la animación.
 *      columna -> Columna donde inicia la animación.
 ******************************************************************************/
void MostrarAnimacionCarga(unsigned char fila, unsigned char columna)
{
    LCD_I2C_CreateSolidPixel(0);
    LCD_I2C_SetCursor(fila, columna);

    for (unsigned char index = 0u; index < 4u; index++)
    {
        LCD_I2C_WriteChar((char)0u);
        __delay_ms(300);
    }
}


/******************************************************************************
 * Función: SubProceso_ResetSistema
 * ---------------------------------------------------------------------------
 * Reinicia el sistema mostrando el avance del proceso en la pantalla LCD.
 *
 * Proceso:
 *      1. Mostrar mensaje de reinicio.
 *      2. Apagar buzzer.
 *      3. Apagar LEDs.
 *      4. Limpiar variables.
 *      5. Finalizar el reinicio.
 ******************************************************************************/
void SubProceso_ResetSistema(void)
{
    /*==============================================================
        Pantalla de inicio
    ==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1, 4);
    LCD_I2C_WriteString("Reiniciando");

    LCD_I2C_SetCursor(2, 6);
    LCD_I2C_WriteString("Sistema");
    __delay_ms(1000);

    /*==============================================================
        Paso 1: Apagar buzzer
    ==============================================================*/
    LCD_I2C_SetCursor(3, 4);
    LCD_I2C_WriteString("Apagando Buzzer");

    Buzzer_Off(&buzzer1);

