ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    MostrarAnimacionCarga(4, 2);

    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_ClearFile();


    /*==============================================================
        Paso 2: Apagar LEDs
    ==============================================================*/
    LCD_I2C_SetCursor(3, 4);
    LCD_I2C_WriteString("Apagando LEDs");

    WS2812B_Clear(&tira1);

    MostrarAnimacionCarga(4, 6);

    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_ClearFile();


    /*==============================================================
        Paso 3: Limpiar variables
    ==============================================================*/
    LCD_I2C_SetCursor(3, 1);
    LCD_I2C_WriteString("Limpiando Variables");

    /**************************************************************
     * Reiniciar aquí todas las variables del sistema
     **************************************************************/
    // contador = 0;
    // estado = 0;
    // alarma = false;
    // etc...

    MostrarAnimacionCarga(4, 10);

    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_ClearFile();


    /*==============================================================
        Paso 4: Finalizar reinicio
    ==============================================================*/
    LCD_I2C_SetCursor(3, 5);
    LCD_I2C_WriteString("Reseteando");

    MostrarAnimacionCarga(4, 14);

    /*==============================================================
        Reinicio final
    ==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(2, 5);
    LCD_I2C_WriteString("Sistema");

    LCD_I2C_SetCursor(3, 4);
    LCD_I2C_WriteString("Reiniciado");

    __delay_ms(1000);
    LCD_I2C_Clear();
}

/******************************************************************************
 * Función: SubProceso_MenuLCD
 *----------------------------------------------------------------------------
 * Muestra el menú principal del sistema y espera a que el usuario seleccione
 * una opción mediante el teclado matricial.
 *
 * Opciones disponibles:
 *   1 -> Agregar horario
 *   2 -> Modificar horario
 *   3 -> Ver horarios
 *   4 -> Registrar pastillas
 *   * -> Resetear sistema
 *
 * Si se ingresa una opción inválida, el menú vuelve a mostrarse.
 ******************************************************************************/
void SubProceso_MenuLCD(void)
{
    /* Inicializar la tecla como "sin pulsar" */
    tecla = KEYPAD_NO_KEY;

    /* Mantener el menú activo hasta recibir una opción válida */
    while (tecla == KEYPAD_NO_KEY)
    {
        /*==============================================================
         * Pantalla de bienvenida
         *==============================================================*/
        LCD_I2C_Clear();

        LCD_I2C_SetCursor(1, 5);
        LCD_I2C_WriteString("Seleccionar");

        LCD_I2C_SetCursor(2, 3);
        LCD_I2C_WriteString("Opcion Deseada");

        __delay_ms(2000);


        /*==============================================================
         * Mostrar menú principal
         *==============================================================*/
        LCD_I2C_Clear();

        LCD_I2C_SetCursor(1, 0);
        LCD_I2C_WriteString("1.Agr.Hor  2.Mod.Hor");

        LCD_I2C_SetCursor(2, 0);
        LCD_I2C_WriteString("3.Ver horarios");

        LCD_I2C_SetCursor(3, 0);
        LCD_I2C_WriteString("4.Reg. pastillas");

        LCD_I2C_SetCursor(4, 0);
        LCD_I2C_WriteString("*.Reset sistema");


        /*==============================================================
         * Esperar la pulsación de una tecla
         * Tiempo máximo aproximado: 5 segundos
         * (500 iteraciones × 10 ms)
         *==============================================================*/
        for (unsigned int index = 0; index < 500; index++)
        {
            tecla = Keypad_Read(&teclado);

            if (tecla != KEYPAD_NO_KEY)
            {
                LCD_I2C_Clear();

                /*======================================================
                 * Procesar la opción seleccionada
                 *======================================================*/
                switch (tecla)
                {
                    case '1':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 2);
                        LCD_I2C_WriteString("Agregar Horario");
                        __delay_ms(2000);
                        return;

                    case '2':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 1);
                        LCD_I2C_WriteString("Modificar Horario");
                        __delay_ms(2000);
                        return;

                    case '3':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 4);
                        LCD_I2C_WriteString("Ver Horarios");
                        __delay_ms(2000);
                        SubProceso_VerHorarios();
                        break;

                    case '4':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 1);
                        LCD_I2C_WriteString("Registrar Pastilla");
                        __delay_ms(2000);
                        SubProceso_RegistrarPastillas();
                        return;

                    case '*':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 3);
                        LCD_I2C_WriteString("Reset sistema");
                        __delay_ms(2000);
                        SubProceso_ResetSistema();
                        return;

                    default:
                        /* Opción inválida: informar al usuario y
                           volver a mostrar el menú. */
                        Buzzer_ErrorSound(&buzzer1);
                        LCD_I2C_SetCursor(2, 2);
                        LCD_I2C_WriteString("Opcion Invalida");
                        __delay_ms(500);

                        tecla = KEYPAD_NO_KEY;
                        break;
                }
            }

            /* Retardo para evitar lecturas excesivamente rápidas */
            __delay_ms(10);
        }
    }
}
/******************************************************************************
 * Función: SubProceso_VerHorarios
 *----------------------------------------------------------------------------
 * Permite visualizar los horarios almacenados en la memoria EEPROM.
 *
 * Flujo:
 *   1. Lee la cantidad de horarios registrados.
 *   2. Verifica que los datos almacenados sean válidos.
 *   3. Prepara la información para su visualización.
 *   4. Muestra los horarios en páginas de hasta 3 registros.
 *   5. Permite navegar entre páginas mediante el teclado.
 *
 * Controles:
 *   A -> Página anterior.
 *   B -> Página siguiente.
 *   * -> Salir.
 ******************************************************************************/
void SubProceso_VerHorarios(void)
{
    /*==============================================================
     * Leer cantidad de horarios registrados
     *==============================================================*/
    LCD_I2C_Clear();

