ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    LCD_I2C_SetCursor(1,6);
    LCD_I2C_WriteString("Horarios");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Leyendo Memoria");

    dato_memoria = EEPROM_ReadByte(1);

    MostrarAnimacionCarga(4,0);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,2);
    LCD_I2C_WriteString("Extrayendo Datos");

    MostrarAnimacionCarga(4,4);

    /*==============================================================
     * Validar información almacenada
     *==============================================================*/
    if (dato_memoria == 0xFF || dato_memoria > 6)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,2);
        LCD_I2C_WriteString("Datos Corruptos");

        __delay_ms(1500);
        return;
    }

    if (dato_memoria == 0)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_WriteString("Sin Hor. Registrados");

        __delay_ms(1500);
        return;
    }

    /*==============================================================
     * Preparar información para mostrarla en pantalla
     *==============================================================*/
    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,2);
    LCD_I2C_WriteString("Preparando Datos");

    MostrarAnimacionCarga(4,8);
    MostrarAnimacionCarga(4,12);

    /*==============================================================
     * Variables de navegación
     *==============================================================*/
    uint8_t cant_horarios = dato_memoria;
    uint8_t pagina = 0;
    uint8_t paginas_max = (cant_horarios - 1) / 3;

    /*==============================================================
     * Navegación entre páginas
     *==============================================================*/
    while (1)
    {
        /*----------------------------------------------------------
         * Mostrar encabezado
         *----------------------------------------------------------*/
        LCD_I2C_Clear();

        LCD_I2C_SetCursor(1,0);
        LCD_I2C_WriteString("--- MIS HORARIOS ---");

        /*----------------------------------------------------------
         * Mostrar horarios de la página actual
         *----------------------------------------------------------*/
        switch (pagina)
        {
            case 0:

                if (cant_horarios >= 1)
                {
                    LCD_I2C_SetCursor(2,0);
                    Detallar_Horarios(1,20,21,22);
                }

                if (cant_horarios >= 2)
                {
                    LCD_I2C_SetCursor(3,0);
                    Detallar_Horarios(2,25,26,27);
                }

                if (cant_horarios >= 3)
                {
                    LCD_I2C_SetCursor(4,0);
                    Detallar_Horarios(3,29,30,31);
                }

                break;

            case 1:

                if (cant_horarios >= 4)
                {
                    LCD_I2C_SetCursor(2,0);
                    Detallar_Horarios(4,33,34,35);
                }

                if (cant_horarios >= 5)
                {
                    LCD_I2C_SetCursor(3,0);
                    Detallar_Horarios(5,37,38,39);
                }

                if (cant_horarios >= 6)
                {
                    LCD_I2C_SetCursor(4,0);
                    Detallar_Horarios(6,41,42,43);
                }

                break;
        }

        /*----------------------------------------------------------
         * Mostrar controles de navegación
         *----------------------------------------------------------*/
        if (pagina > 0)
        {
            LCD_I2C_SetCursor(2,12);
            LCD_I2C_WriteString("[A]Subir");
        }

        if (pagina < paginas_max)
        {
            LCD_I2C_SetCursor(4,12);
            LCD_I2C_WriteString("[B]Bajar");
        }

        LCD_I2C_SetCursor(3,12);
        LCD_I2C_WriteString("[*]Salir");

        /*----------------------------------------------------------
         * Esperar una tecla del usuario
         *----------------------------------------------------------*/
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        /*----------------------------------------------------------
         * Procesar la tecla presionada
         *----------------------------------------------------------*/
        switch (tecla)
        {
            case 'A':

                Buzzer_ButtonClick(&buzzer1);

                if (pagina > 0)
                    pagina--;

                break;

            case 'B':

                Buzzer_ButtonClick(&buzzer1);

                if (pagina < paginas_max)
                    pagina++;

                break;

            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            default:

                /* Tecla sin función en esta pantalla */
                Buzzer_WarningSound(&buzzer1);
                break;
        }
    }
}
/******************************************************************************
 * Función: SubProceso_RegistrarPastillas
 *----------------------------------------------------------------------------
 * Permite registrar una recarga de pastillas en uno de los cuatro
 * compartimientos disponibles.
 *
 * Flujo:
 *   1. Lee el stock total almacenado en EEPROM.
 *   2. Verifica que los datos sean válidos.
 *   3. Muestra el stock actual de cada pastillero.
 *   4. Permite seleccionar el compartimiento (1-4).
 *   5. Solicita la cantidad de pastillas a agregar.
 *   6. Guarda la nueva información al confirmar con '#'.
 *
 * Controles:
 *   1-4 -> Seleccionar pastillero.
 *   0-9 -> Cantidad a agregar.
 *   #   -> Guardar cambios.
 *   *   -> Cancelar operación.
 ******************************************************************************/
void SubProceso_RegistrarPastillas(void)
{
    uint8_t pastillero_selecionado;
    uint8_t cantidad_a_sumar = 0;

    /*==============================================================
     * Leer stock total de pastillas
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,1);
    LCD_I2C_WriteString("REG. CANT. PASTILLAS");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Leyendo Memoria");

    dato_memoria = EEPROM_ReadByte(2);

    MostrarAnimacionCarga(4,0);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Extrayendo Datos");

    MostrarAnimacionCarga(4,4);

    /*==============================================================
     * Validar datos leídos
     *==============================================================*/
    if (dato_memoria == 0xFF)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

