ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
        LCD_I2C_SetCursor(3,2);
        LCD_I2C_WriteString("Datos Corruptos");

        __delay_ms(1500);
        return;
    }

    /*==============================================================
     * Mostrar stock total disponible
     *==============================================================*/
    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Pastillas disp: ");
    LCD_I2C_WriteUInt8(dato_memoria,2);

    MostrarAnimacionCarga(4,8);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Preparando sistema..");

    MostrarAnimacionCarga(4,12);

    /*==============================================================
     * Mostrar stock individual de cada pastillero
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString(" STOCK PASTILLEROS ");

    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("P1:[");
    dato_memoria = EEPROM_ReadByte(10);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]      P2:[");

    dato_memoria = EEPROM_ReadByte(11);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("P3:[");

    dato_memoria = EEPROM_ReadByte(12);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]      P4:[");

    dato_memoria = EEPROM_ReadByte(13);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]");

    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("Seleccione (1-4):[ ]");

    /*==============================================================
     * Esperar la selección del pastillero
     *==============================================================*/
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '1':
            case '2':
            case '3':
            case '4':

                Buzzer_ButtonClick(&buzzer1);

                pastillero_selecionado = tecla - '0';

                LCD_I2C_SetCursor(4,18);
                LCD_I2C_WriteChar(tecla);

                __delay_ms(50);

                Detallar_CantPastillas(pastillero_selecionado);

                break;

            default:

                Buzzer_WarningSound(&buzzer1);

                LCD_I2C_SetCursor(4,18);
                LCD_I2C_WriteString("-");

                tecla = KEYPAD_NO_KEY;
        }

        /* Salir únicamente cuando la selección sea válida */
        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*==============================================================
     * Esperar la cantidad de pastillas a registrar
     *==============================================================*/
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            /*------------------------------------------
             * Teclas sin función en esta pantalla
             *-----------------------------------------*/
            case 'A':
            case 'B':
            case 'C':
            case 'D':

                Buzzer_WarningSound(&buzzer1);
                break;

            /*------------------------------------------
             * Cancelar operación
             *-----------------------------------------*/
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /*------------------------------------------
             * Confirmar y guardar datos
             *-----------------------------------------*/
            case '#':

                Buzzer_CorrectSound(&buzzer1);

                Guardar_CantPastillas(
                    pastillero_selecionado,
                    cantidad_a_sumar);

                __delay_ms(200);

                return;

            /*------------------------------------------
             * Registrar cantidad ingresada
             *-----------------------------------------*/
            default:

                Buzzer_ButtonClick(&buzzer1);

                cantidad_a_sumar = tecla - '0';

                LCD_I2C_SetCursor(3,18);
                LCD_I2C_WriteChar(tecla);

                break;
        }
    }
}
void Guardar_CantPastillas(uint8_t  pastillero_selecionado , uint8_t cantidad_a_sumar)
{
    const uint8_t ubicacion_memoria[] = {10, 11, 12, 13};
    dato_memoria = EEPROM_ReadByte(ubicacion_memoria[pastillero_selecionado-1]);//Leemos el dato de la memoria de -> comportimentx cantidad de pastillas
    EEPROM_UpdateByte(ubicacion_memoria[pastillero_selecionado-1],dato_memoria+cantidad_a_sumar);// Al pastillero indiviadual
    dato_memoria = EEPROM_ReadByte(2);//Leemos el valor de la direccion de -> cantidad de apstillas total
    EEPROM_UpdateByte(2,dato_memoria+ cantidad_a_sumar);// Cantidad de pastillas generales
    LCD_I2C_Clear();
    LCD_I2C_SetCursor(1, 0);
    LCD_I2C_WriteString("-- RECARGA EXITOSA--");
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("PASTILLERO ");
    LCD_I2C_WriteUInt8(pastillero_selecionado,1);
    LCD_I2C_WriteString("LISTO");
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Total actual: [");
    dato_memoria = EEPROM_ReadByte(ubicacion_memoria[pastillero_selecionado-1]);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]");
}
void Detallar_CantPastillas(uint8_t  tecla)
{
    const uint8_t ubicacion_memoria[] = {10, 11, 12, 13};
    LCD_I2C_Clear();
    LCD_I2C_SetCursor(1, 0);
    LCD_I2C_WriteString("-- RECARGA PAST. ");
    LCD_I2C_WriteUInt16(tecla,2,0);
    LCD_I2C_WriteString("--");
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Stock actual   : ");
    dato_memoria = EEPROM_ReadByte(ubicacion_memoria[tecla-1]);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_WriteString("A sumar        : 00");
    LCD_I2C_SetCursor(4, 0);
    LCD_I2C_WriteString("Guardar:[#] Salir:*");
}
void Detallar_Horarios(uint8_t numero,uint16_t hora,uint16_t minuto,uint16_t tipo)
{
    //1. 08:00 P1  5.18:00P4
    LCD_I2C_WriteUInt8(numero,1);
    LCD_I2C_WriteString(". ");
    dato_memoria = EEPROM_ReadByte(hora);//Hora
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString(":");
    dato_memoria = EEPROM_ReadByte(minuto);//Minuto
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString(" P");
    dato_memoria = EEPROM_ReadByte(tipo);//Tipo de compartimento
    LCD_I2C_WriteUInt8(dato_memoria,1);
}